In [2]:
import numpy as np 
import pandas as pd

In [3]:
sozluk1 = {"isim":["ahmet","mehmet","zeynep","atil"],
           "spor" :["kosu","yuzme","kosu","basketnol"],
          "kalori" : [100,200,300,400]
          }

In [4]:
dataFrame1 = pd.DataFrame(sozluk1, index=[0,1,2,3])

In [5]:
dataFrame1

     isim       spor  kalori
0   ahmet       kosu     100
1  mehmet      yuzme     200
2  zeynep       kosu     300
3    atil  basketnol     400

In [6]:
sozluk2 = {"isim" : ["osman","levent","atlas","fatma"],
          "spor" : ["kosu","yuzme","kosu","basketbol"],
           "kalori" : [200,100,50,300]
          }

In [7]:
dataFrame2 = pd.DataFrame(sozluk2 , index=[4,5,6,7])

In [8]:
sozluk3 = {"isim" : ["ayse","mahmut","duygu","nur"],
          "spor" : ["kosu","yuzme","badminton","tenis"],
           "kolari" : [300,400,500,250]
          }

In [9]:
dataFrame3 = pd.DataFrame(sozluk3 , index=[8,9,10,11])

In [10]:
"dataframe pandas.ipynb"

'dataframe pandas.ipynb'

In [11]:
dataFrame2

     isim       spor  kalori
4   osman       kosu     200
5  levent      yuzme     100
6   atlas       kosu      50
7   fatma  basketbol     300

In [12]:
dataFrame3

      isim       spor  kolari
8     ayse       kosu     300
9   mahmut      yuzme     400
10   duygu  badminton     500
11     nur      tenis     250

## concatenation

In [16]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      isim       spor  kalori  kolari
0    ahmet       kosu   100.0     NaN
1   mehmet      yuzme   200.0     NaN
2   zeynep       kosu   300.0     NaN
3     atil  basketnol   400.0     NaN
4    osman       kosu   200.0     NaN
5   levent      yuzme   100.0     NaN
6    atlas       kosu    50.0     NaN
7    fatma  basketbol   300.0     NaN
8     ayse       kosu     NaN   300.0
9   mahmut      yuzme     NaN   400.0
10   duygu  badminton     NaN   500.0
11     nur      tenis     NaN   250.0

## merge

In [17]:
mergeSozluk1= {"isim" : ["ahmet","mehmet","zeynep","atıl"],
              "spor" : ["kosu","yuzme","kosu","basketbol"]
              }

In [18]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [19]:
mergeDataFrame1

     isim       spor
0   ahmet       kosu
1  mehmet      yuzme
2  zeynep       kosu
3    atıl  basketbol

In [20]:
mergeSozluk2= {"isim" : ["ahmet","mehmet","zeynep","atıl"],
              "kalori" : [100,200,150,250]
              }

In [21]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [22]:
mergeDataFrame2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     150
3    atıl     250

In [24]:
pd.merge(mergeDataFrame1, mergeDataFrame2 ,on="isim")  #3. veri ortak olacak sütun

     isim       spor  kalori
0   ahmet       kosu     100
1  mehmet      yuzme     200
2  zeynep       kosu     150
3    atıl  basketbol     250

In [25]:
maasSozluk = {"isim" : ["atil","zeynep","mehmet","ahmet"],
             "departman" : ["yazılım","satış","pazarlama","yazılım"],
             "maas" : [200,300,400,500]
             }

In [26]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [27]:
maasDataFrame

     isim  departman  maas
0    atil    yazılım   200
1  zeynep      satış   300
2  mehmet  pazarlama   400
3   ahmet    yazılım   500

In [30]:
maasDataFrame["departman"].unique()

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [31]:
maasDataFrame["departman"].nunique()

3

In [32]:
maasDataFrame["departman"].value_counts()

yazılım      2
satış        1
pazarlama    1
Name: departman, dtype: int64

In [37]:
def bruttenNete(maas):
    return maas * 0.66

In [38]:
maasDataFrame["maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: maas, dtype: float64

In [39]:
maasDataFrame.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [44]:
yeniBirVeri = {"karakter sınıfı" : ["south park","south park","simpson","simpson","simpson"],
              "karakter ismi" : ["cartman","kenny","homer","bart","bart"],
              "karakter yas" : [9,10,50,20,10]
              }

In [45]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [46]:
karakterDF

  karakter sınıfı karakter ismi  karakter yas
0      south park       cartman             9
1      south park         kenny            10
2         simpson         homer            50
3         simpson          bart            20
4         simpson          bart            10

In [48]:
karakterDF.pivot_table(values="karakter yas",index= ["karakter sınıfı", "karakter ismi"],aggfunc= np.sum)

                               karakter yas
karakter sınıfı karakter ismi
simpson         bart                     30
                homer                    50
south park      cartman                   9
                kenny                    10